## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 9 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                    |
|--------|-------------------------------------------|
| update | `aws_lambda_function.audit_logs`          |
|        | `aws_lambda_function.form_archiver`       |
|        | `aws_lambda_function.nagware`             |
|        | `aws_lambda_function.reliability`         |
|        | `aws_lambda_function.vault_integrity`     |
|        | `aws_s3_bucket_object.audit_logs_code`    |
|        | `aws_s3_bucket_object.form_archiver_code` |
|        | `aws_s3_bucket_object.nagware_code`       |
|        | `aws_s3_bucket_object.reliability_code`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "iMfvFxLKoRigCnZVFaJuLTUsn_6RFOu5" -> (known after apply)
      ~ source_code_hash               = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "B8Bl8oG5f782YnJMrNbXEERFfBD1Fqty0sNguOEwK74="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "j94rcpwyFRwAA7JXRDCDafL85O6hDx2J" -> (known after apply)
      ~ source_code_hash               = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "WjMvfNOMl9gwC2lCQTygRjT4T37LxvXnYEpb0dTJC+c="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2023-12-14T16:47:42.000+0000" -> (known after apply)
      ~ s3_object_version              = "TvJ2N1_.VVw5oGteCmT4AbDx3ioM1jrD" -> (known after apply)
      ~ source_code_hash               = "OcLo5We0JHv2naLzzmmeTs5+2hTEVT1bAlfB7LuxJFs=" -> "jY8Ml11j0RNBpIIOltSGaRTH3GcZq/ZNNV0MoDv1ZEo="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2023-12-13T19:30:42.000+0000" -> (known after apply)
      ~ s3_object_version              = "4Om4TGyikL91F7nkKFedil3uV.tyzsU6" -> (known after apply)
      ~ source_code_hash               = "nf3YFotstkw84Smj5lGE5Dft0jWhLgYZGsp2crPVU6Q=" -> "WlpVNiPu3DGXzkja0P6xddheYxL4hPmhcJwZ99rM7NQ="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2023-12-14T16:47:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "9opCvMNrZA+BCLvHUGkHDweCXfVwLgP5jcHfkTPLySc=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "B8Bl8oG5f782YnJMrNbXEERFfBD1Fqty0sNguOEwK74="
        tags                   = {}
      ~ version_id             = "iMfvFxLKoRigCnZVFaJuLTUsn_6RFOu5" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "WjMvfNOMl9gwC2lCQTygRjT4T37LxvXnYEpb0dTJC+c="
        tags                   = {}
      ~ version_id             = "j94rcpwyFRwAA7JXRDCDafL85O6hDx2J" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.nagware_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "OcLo5We0JHv2naLzzmmeTs5+2hTEVT1bAlfB7LuxJFs=" -> "jY8Ml11j0RNBpIIOltSGaRTH3GcZq/ZNNV0MoDv1ZEo="
        tags                   = {}
      ~ version_id             = "TvJ2N1_.VVw5oGteCmT4AbDx3ioM1jrD" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.reliability_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "nf3YFotstkw84Smj5lGE5Dft0jWhLgYZGsp2crPVU6Q=" -> "WlpVNiPu3DGXzkja0P6xddheYxL4hPmhcJwZ99rM7NQ="
        tags                   = {}
      ~ version_id             = "4Om4TGyikL91F7nkKFedil3uV.tyzsU6" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 0 to add, 9 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.audit_logs_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.form_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.nagware_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.reliability_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.reliability_dlq_consumer_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.response_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.submission_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.vault_integrity_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_signer_signing_profile.lambda_signing_profile[0]"]

40 tests, 19 passed, 21 warnings, 0...
```

</details>
